import {Telegraf} from 'telegraf';
import * as dotenv from 'dotenv'
import {actionButtons, angry, gas, gnz, homeViolence} from "./actionButtons.js";

dotenv.config()
export const bot = new Telegraf('5927833900:AAFyvYliET2_Xe5YlVWHk5oVUME_fX29hhE');

// Commands for BOT
bot.command('quit', async (ctx) => {
    try {
        await ctx.telegram.leaveChat(ctx.message.chat.id);
        await ctx.leaveChat();
    } catch (e) {
        console.log(e)
    }
});
bot.command('start', async (ctx) => {
    try {
        await ctx.replyWithHTML(`<b>👋 Привіт ${ctx.chat.first_name}! Мене звати СкладнеПросто!</b>`, await actionButtons())
        await ctx.reply(`Я допоможу вам просто пояснити про такі складні життєві обставини, як токсичні, аб'юзивні стосунки, роз'ясню такі поняття, як «харасмент», «газлайтинг» та що таке домашнє та гендерно зумовлене насильство і як йому запобігти. А, найголовніше, — тут знайдете контакти, куди ви можете звернутися по допомогу у Кіровоградській області. Нижче виберіть тему, яка вас цікавить:`)
    } catch (e) {
        console.log(e)
    }
});
bot.hears('Повернутись ◀️', async (ctx) => {
    try {
        await ctx.reply('Ви повернулись до головного меню', await actionButtons())
    } catch (e) {
        console.log(e)
    }
})
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//////GNZ

bot.hears('♀️♂️Гендерно зумовлене насильство', async (ctx) => {
    try {
        await ctx.reply('Гендерно зумовлене насильство (ГЗН) є одним із найпоширеніших порушень прав людини у світі. ГЗН — це насильство, спрямоване проти особи через її гендерну належність, або насильство, яке непропорційно впливає на осіб певної статі. ГЗН зазнають як жінки, так і чоловіки, але серед постраждалих більшість становлять усе ж жінки та дівчата, оскільки це явище глибоко вкорінене в нерівності жінок і чоловіків.', await gnz())
    } catch (e) {
        console.log(e)
    }
})
bot.hears('💔 Приклади ГЗН', async (ctx) => {
    try {
        await ctx.reply('Гендернозумовлене насильство має безліч різних форм. Наведемо деякі з них:', await gnz())
        await ctx.reply('⚡ сексуальні домагання;')
        await ctx.reply('⚡ примусовий, зокрема ранній (дитячий), шлюб;')
        await ctx.reply('⚡ торгівля людьми з метою сексуальної експлуатації;')
        await ctx.reply('⚡ насильство в інтернеті — погрози, переслідування або підбурювання до насильства, надсилання небажаних, образливих повідомлень або повідомлень сексуального змісту, пересилання приватних зображень чи відео без згоди або таких, які демонструють неприйнятну поведінку, в соціальних мережах;')
        await ctx.reply('⚡ сталкінг —  це прояв психологічного насильства, що полягає у нав’язливому переслідуванні людини в реальному житті та онлайн, відстеження будь-якої інформації про неї всупереч її волі та бажання;')
        await ctx.reply('⚡ харасмент —  форма дискримінації, яка включає будь-яку небажану та настирливу фізичну і словесну поведінку, що ображає або принижує людину або порушує недоторканність її приватного життя. Іншими словами, харасмент (переслідування) складається з повторюваних і наполегливих дій по відношенню до людини, щоб мучити її, знецінювати і підривати її авторитет в очах інших, засмучувати або провокувати реакцію.')
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🤔 Хто вчиняє ГЗН?', async (ctx) => {
    try {
        await ctx.reply('Будь-хто може вчинити ГЗН, зокрема хтось із подружжя, інтимний партнер(-ка), члени сім’ї, колеги(-жанки) або керівник(-ця), однокласники(-ці), одногрупники(-ці), доглядальник(-ця), один(-а) із батьків, один(-а) із батьків партнера(-ки), незнайома особа або хтось, хто вчиняє акти сексуального характеру в обмін на гроші або товари.', await gnz())
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🤔Хто може постраждати від ГЗН?', async (ctx) => {
    try {
        await ctx.reply('Це стосується також тих осіб, які перебувають у шлюбі, літніх людей або секс-працівниць(-ків). Люди ЛГБТІК+ мають підвищений ризик завдання їм шкоди або вчинення відносно них насильства через їхню сексуальну орієнтацію та/або гендерну ідентичність.Будь-хто може зазнати ГЗН.', await gnz())
    } catch (e) {
        console.log(e)
    }
})
bot.hears('💔Якщо я зазнав (-ла) ГЗН', async (ctx) => {
    try {
        await ctx.reply('Якщо Ви зазнали гендернозумовлене насильство, не проживайте цей досвід на самоті!', await gnz())
        await ctx.reply('📌Зверніться по допомогу до близьких')
        await ctx.reply('📌Обмежте спілкування з кривдником(-цею)')
        await ctx.reply('📌Зверніться по допомогу до психолога')
        await ctx.reply('📌Зверніться по допомогу на телефони гарячих ліній')
        await ctx.reply('📌Зверніться до правоохоронних органів')
        await ctx.reply('❗Національна гаряча лінія для дітей та молоді «Ла Страда – Україна»:')
        await ctx.reply('📞0 800 500 225 (працює цілодобово)')
        await ctx.reply('📞116 111 (цілодобово)')
        await ctx.reply('Тут надають анонімну психологічну підтримку дітям та підліткам: допомагають впоратися з психологічними проблемами, розкажуть, що робити, якщо дитина/підліток зіткнулися з насильством або жорстоким поводженням. Дорослих на гарячій лінії консультують психологи(-ні), юристи(-ки) та соціальні працівники(-ці) щодо випадків порушення прав дитини.')
        await ctx.reply('❗Національна гаряча лінія з попередження домашнього насильства, торгівлі людьми та гендерної дискримінації «Ла Страда – Україна»:')
        await ctx.reply('📞0 800 500 335')
        await ctx.reply('📞116 123')
        await ctx.reply('На гарячій лінії надають психологічну підтримку та консультацію тим, хто зазнав чи зазнає фізичного, психологічного, сексуалізованого чи економічного насильства.')
    } catch (e) {
        console.log(e)
    }
})

// Help Contact

bot.hears('📞 Контакти допомоги', async (ctx) => {
    try {
        await ctx.replyWithHTML(`Якщо ви зазнали будь-якого прояву насильства, пам'ятайте: традиційне українське «б’є – значить любить» та «не винось сміття з хати» не причина замовчувати насильство над собою та близькими! Законодавством забезпечено ваше право захистити від насильства себе та своїх близьких!`)
        await ctx.reply(`❗ВАМ ДОПОМОЖУТЬ:`)
        await ctx.reply(`🔸 Зверніться до поліції за номером 102. Постраждалого(-лу) можуть направити до спеціалізованого центру із запобігання та протидії насильству — безпечного захищеного простору, де можна отримати кваліфіковану допомогу психологів і лікарів.`)
        await ctx.reply(`🔸 До мобільних бригад соціально-психологічної допомоги постраждалим від домашнього насильства у Кропивницькому:`)
        await ctx.reply(`📞 (063) 216-90-82`)
        await ctx.reply(`📞 (063) 216-87-35`)
        await ctx.reply(`🔸Кропивницький міський центр соціальних служб (працює з 8:00 до 16:00):`)
        await ctx.reply(`📞 0(522) 32-04-79`)
        await ctx.reply(`📞 (098) 840-85-60`)
        await ctx.reply(`🔸Обласний центр соціально-психологічної допомоги Кіровоградської обласної адміністрації (працює з 8:00 до 17:00):`)
        await ctx.reply(`📞 (093) 294-60-50`)
        await ctx.reply(`🔸Кіровоградський обласний центр соціальних служб Кіровоградської обласної військової адміністрації (працює з 8:00 до 17:00):`)
        await ctx.reply(`📞 0(522) 32-10-07`)
        await ctx.reply(`🔸Кропивницький місцевий центр із надання безоплатної вторинної правової допомоги: (працює з 8:00 до 17:00)`)
        await ctx.reply(`📞 0(522) 32-08-24`)
        await ctx.reply(`🔸Якщо ви перебуваєте у складних життєвих обставинах, можете звернутися до простору «Дім Милосердя» Кропивницький:`)
        await ctx.reply(` 🏠 вул. Преображенська, 37`)
        await ctx.reply(`📞 (073) 00-70-078`)
        await ctx.reply(`🔸 Національна дитяча гаряча лінія Центру «Ла Страда Україна»:`)
        await ctx.reply(`📞 0-800-500-333 та 116 111 (для дзвінків з мобільного).`)
        await ctx.reply(` 🔸 Національна «ГАРЯЧА ЛІНІЯ» з питань запобігання насильству (консультації юриста(-ки), психолога(-ині), соціального(-ї) педагога(-ині):`)
        await ctx.reply(`📞 0-800-500-335 та 116-123 (безкоштовно з міських телефонів)`)
        await ctx.reply(`📞 0-800-500-225 та 116-111`)
        await ctx.reply(`Тут можна отримати:`)
        await ctx.reply(`- інформаційні консультації (інформація про організації та установи, до яких можна звернутися у конкретній ситуації, перелік документів, які необхідно підготувати для звернення та інше);`)
        await ctx.reply(`- психологічні консультації (поради та підтримку психолога анонімно у телефонному режимі);`)
        await ctx.reply(`🔸Омбудсмен з прав людини в Україні:`)
        await ctx.reply(`📞 (044) 253 75 89`)
        await ctx.reply(`📞 0 800 50 17 20`)
        await ctx.reply(`🔸 Єдиний телефонний номер системи надання безоплатної правової допомоги:`)
        await ctx.reply(`📞 0 800 213 103`)
        await ctx.reply(`Безкоштовно зі стаціонарних та мобільних телефонів, можна отримати такі послуги:`)
        await ctx.reply(`- безоплатна правова допомога дітям, які перебувають у складних життєвих обставинах;`)
        await ctx.reply(`- правові консультації;`)
        await ctx.reply(`- роз’яснення з питань отримання безоплатної правової допомоги;`)
        await ctx.reply(` - інформацію про гарячі телефонні лінії з питань надання соціальних послуг та захисту прав людини, та установи, які опікуються відповідними питаннями;`)
        await ctx.reply(`- зв'язатися з усіма центрами з надання безоплатної вторинної правової допомоги, отримати інформацію про їх місцезнаходження, контактні номери телефонів, інші засоби зв’язку.`)
    } catch (e) {
        console.log(e)
    }
})

// sexual abuse
bot.hears('🙅‍♀️Сексуальні домагання', async (ctx) => {
    try {
        await ctx.reply('Досить поширеним явищем є сексуальні домагання, що також можуть завдати людині вельми серйозної шкоди. Сексуальним домаганням можна вважати будь-який прояв уваги сексуального характеру, яка людині неприємна і якої він або вона не бажає.')
        await ctx.reply('Приклади сексуальних домагання:')
        await ctx.reply('Вуличні докучання («Агов, красуня, як щодо того, аби повеселитися?» Дотики і притискання у громадському транспорті, на дискотеці, в черзі.«Знаки уваги» водіїв таксі, незнайомих людей у ліфті, попутників у купе поїзда. Слизькі жарти, вульгарні зауваження, непристойні жести.')
        await ctx.reply('❗Щоб навчитися встановлювати комфортні кордони в сексуальних стосунках, важливо усвідомити декілька правил:')
        await ctx.reply('☝️ваше тіло належить тільки вам. Ви і тільки ви можете розпоряджатися своїм тілом;')
        await ctx.reply('☝️вам вирішувати, коли, з ким і за яких обставин ви можете допустити фізичну близькість;')
        await ctx.reply('☝️ваше здоров’я і безпека – в зоні вашої відповідальності. У будь-якому питанні, що стосується вашого здоров’я і безпеки, ви повинні покладатися тільки на себе і свої власні відчуття. Особливо це стосується сексуальної близькості;')
        await ctx.reply('☝️ви маєте право самі розпоряджатися своєю сексуальністю. Тільки ви можете дати оцінку своєї сексуальності, відповісти на питання, чи бажаєте ви інтиму в даний момент або ще не готові;')
        await ctx.reply('☝️ви маєте право відмовитися від видів сексуальних контактів, які ви не приймаєте. Навіть якщо ваш чоловік просить щось, що для вас є абсолютним табу, ви маєте право не погодитися;')
        await ctx.reply('☝️ви не повинні виправдовувати очікування партнера. Ви маєте повне право бути в ліжку такий(-ка), який/яка ви є;')
        await ctx.reply('☝️ваш(-а) партнер(-ка) вам нічого не винен/не винна. Ті ж права, що є у вас, є і у вашого(ї) партнера(-ки). І їх слід поважати. Тому, якщо ви хочете гармонійних стосунків, приберіть із вашого лексикону фразу «чоловік повинен»/ «жінка повинна».')
        await ctx.reply('⚠️Якщо ви стали свідком прояву насильства, або знаєте про такі випадки – важливо про це говорити та розповідати про це іншим! Подолання такого негативного явища можливо лише за умови об’єднання зусиль державних органів та установ, громадських організацій, і кожного з нас. Не мовчіть, дійте!')
        await ctx.reply('📞116 123 – гаряча лінія із попередження домашнього насильства, торгівлі людьми та гендерної дискримінації в Україні. Ви маєте можливість пройти онлайн-тренінг щодо протидії домаганням у громадських місцях за посиланням:')
        await ctx.replyWithHTML('<a href="https://www.loreal-paris.ua/stand-up">https://www.loreal-paris.ua/stand-up</a>')
    } catch (e) {
        console.log(e)
    }
})
//complex relationship
bot.hears('💔 Складні стосунки', async (ctx) => {
    try {
        await ctx.reply('Часом розпізнати аб’юзивні стосунки у реальному житті надзвичайно важко, а особливо — якщо ви вже у них потрапили. За повсякденними турботами та позитивними моментами суть ставлення до вас може загубитися, тому важливо розуміти та пам’ятати, що у здорових взаєминах прийнятно, а що ні.')
        await ctx.reply('Аб’юз  — це зневажливе чи презирливе ставлення до партнера(-ки), психологічний тиск. Аб’юзивними стосунками можна вважати ті, що мають систематичні порушення особистих меж, спілкування з недовірою чи неповагою. Тут завжди є постраждала(-ий) і кривдник(-ця), які ніколи не міняються місцями.')
        await ctx.reply('Є аб’юзер(-ка), який(-а) систематично здійснює шантаж, ревнує, маніпулює, принижує, ображає, намагається підірвати самооцінку чи вплинути на емоційний стан. Навіть жарти, які ображають партнера(-ку), — це аб’юз! ')
        await ctx.reply('Є постраждала(-ий) від аб’юзу, які іноді можуть і не підозрювати, що перебувають у насильницькому щодо себе середовищі. Якщо він чи вона не ставали свідками здорових стосунків, то можуть нормально ставитись до аб’юзу, сприймаючи це за турботу. Так і виникають «виправдання» кривдникам(-цям): «Контролює, з ким я, бо хвилюється», «Ревнує, бо я йому дорога(-ий)», «Вона/він критикує, бо хоче, щоб я ставав(-ла) кращим(-ою)» тощо. Але це не так. У гармонійних стосунках немає місця приниженням і знущанням!')
        await ctx.replyWithHTML(`<b>Як розпізнати аб'юзера(-рку)</b>`)
        await ctx.replyWithHTML('💔 Вам дискомфортно у комунікації (ви не можете домовитися та не відчуває прийняття ваших думок/поглядів).')
        await ctx.replyWithHTML('💔 Ігноруються ваші потреби, вподобання, досягнення.')
        await ctx.replyWithHTML('💔 Вас безпідставно звинувачують у навмисному завданні образи чи шкоди. Вам цілеспрямовано створюють так звані «емоційні гойдалки»  і вам доводиться не лише вгадувати причини змін емоцій, але й підлаштовуватися під  наслідки, адже саме ви відчуваєте емоції за емоції партнера(-ки).')
        await ctx.replyWithHTML('💔 Цілеспрямовано створюються такі ситуації, в яких ви почуваєте себе слабким(-ою), безпорадним(-ною).')
        await ctx.replyWithHTML(`💔 Аб'юзер(-ка) не терпить, коли йому/їй потрібно відповідати за наслідки власних вчинків. Він/вона вимагає миттєвого прощення щодо себе, а ось вам його/її прихильність після будь-якого непорозуміння потрібно буквально завойовувати знову.`)

    } catch (e) {
        console.log(e)
    }
})
// Gaslighting


bot.hears('🤯 Газлайтинг', async (ctx) => {
    try {
        await ctx.reply('Газлайтинг — це форма психологічного насильства, задачею якого є змушення постраждалого(-ї) сумніватися в адекватності власного сприйняття, пам’яті, а зрештою, і психічному здоров’ї через заперечення фактів та подій.', await gas())
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🤔Навіщо кривдникам(-цям) таке?', async (ctx) => {
    try {
        await ctx.reply('Людина, яка не впевнена у власній адекватності, не може відстоювати свої кордони та ухвалювати рішення на власну користь: вона розгублена, налякана, готова повірити будь-чому. Таких людей легше переконати у чомусь, прив’язати до себе, зробити залежними від власного авторитету.')
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🤔Як боротися з газлайтингом?', async (ctx) => {
    try {
        await ctx.reply('Є два вектори боротьби. Один спрямований на те, щоб відновити впевненість у собі, а інший — на взаємодію з кривдником(-цею). Щоб упевнитися, що з вами все гаразд, спробуйте записувати ключові події та слова у щоденник або навіть на диктофон. Це допоможе швидко відновити в пам’яті той чи інший епізод та довести щось за потреби. Незле також розповісти про ситуацію близьким. Якщо ви почнете сумніватися у власних судженнях, інша людина стане об’єктивним спостерігачем. Із кривдником(-цею) тактика доведення власної правоти не завжди працює. Краще просто якомога менше спілкуватися з такою людиною (або частіше робити це при свідках), а якщо аб’юзер(-ка) спробує застосувати газлайтинг, то сказати про це прямо: «Зараз ти хочеш мною зманіпулювати, і я це бачу. Не роби так, інакше я просто не продовжуватиму діалог».')
    } catch (e) {
        console.log(e)
    }
})
// Domestic violence
bot.hears('⚠️ Домашнє насильство', async (ctx) => {
    try {
        await ctx.reply(`Домашнє насильство — це діяння (дії або бездіяльність) фізичного, сексуального, психологічного або економічного насильства, що вчиняються в сім'ї чи в межах місця проживання або між родичами, або між колишнім або теперішнім подружжям, або між іншими особами, які спільно проживають (проживали) однією сім'єю, але не перебувають (перебували) у родинних відносинах чи у шлюбі між собою, незалежно від того, чи проживає (проживала) особа, яка вчинила домашнє насильство, у тому самому місці, що й постраждала особа, а також погрози вчинення таких діянь.  Наводимо форми домашнього насильства та їх найбільш характерні ознаки.`, await homeViolence())
    } catch (e) {
        console.log(e)
    }
})
bot.hears('💰Економічне насильство', async (ctx) => {
    try {
        await ctx.reply('Закон України «Про запобігання та протидію домашньому насильству» визначає його як форму домашнього насильства, що включає:')
        await ctx.reply('🔸умисне позбавлення житла, їжі, одягу, іншого майна, коштів чи документів або можливості користуватися ними,')
        await ctx.reply('🔸залишення без догляду чи піклування,')
        await ctx.reply('🔸перешкоджання в отриманні необхідних послуг з лікування чи реабілітації,')
        await ctx.reply('🔸заборону працювати,')
        await ctx.reply('🔸заборону навчатися.')
        await ctx.reply('☝️Небезпека економічного насильства полягає також в тому, що воно включає в себе контроль не тільки  і наявного, і потенційного доходу, через перешкоджання освіті і зайнятості постраждалих.')
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🤯Психологічне насильство', async (ctx) => {
    try {
        await ctx.reply('Психологічне насильство – форма домашнього насильства, коли дії або бездіяльність викликали у постраждалої особи побоювання за свою безпеку чи безпеку третіх осіб, спричинили емоційну невпевненість, нездатність захистити себе або завдали шкоди психічному здоров’ю особи. Психологічне насильство включає:')
        await ctx.reply('🔸словесні образи, погрози, у тому числі щодо третіх осіб;')
        await ctx.reply('🔸приниження;')
        await ctx.reply('🔸переслідування;')
        await ctx.reply('🔸залякування;')
        await ctx.reply('🔸інші діяння, спрямовані на обмеження волевиявлення особи;')
        await ctx.reply('🔸контроль у репродуктивній сфері;')
        await ctx.reply('🔸навіювання почуття провини;')
        await ctx.reply('🔸заборона спілкуватися з рідним.')
    } catch (e) {
        console.log(e)
    }
})

bot.hears('🆘Я зазнав(-ла) домашнього насильства', async (ctx) => {
    try {
        await ctx.reply('📌Алгоритм дій:')
        await ctx.reply('1️⃣Викликати поліцію за номером 102, зафіксувати вчинення домашнього насильства.')
        await ctx.reply('2️⃣Якщо існує загроза життю чи здоров’ю, наполягати винести  терміновий заборонний припис поліцією на місці.')
        await ctx.reply('3️⃣Звернутися до відділку поліції з письмовою заявою про домашнє насильство.')
        await ctx.reply('4️⃣У разі вчинення фізичного насильства, взяти в слідчого направлення на проходження судово-медичної експертизи для зняття побоїв.')
        await ctx.reply('5️⃣Прослідкувати, щоб була відкрита справа в судовому реєстрі.')
        await ctx.reply('6️⃣За необхідності звернутися до соціальних служб за отриманням психологічної допомоги та/або знайти шелтер для безбечнного перебування.')
        await ctx.reply('7️⃣Звернутися до центрів безоплатної правової допомоги для отримання супроводу')
        await ctx.reply('8️⃣Звернутися до суду щодо винесення обмежувального припису кривднику.')
        await ctx.reply('За консультацією завжди звертайтеся на  Національну гарячу лінію з попередження домашнього насильства, торгівлі людьми та ґендерної дискримінації:')
        await ctx.reply('📲 116 123')
        await ctx.reply('📞 0 800 500 335')
        await ctx.reply('📲 15-47')
        await ctx.reply('Гаряча лінія для постраждалих від домашнього насильства. Одна з її функцій — це психологічна допомога жертвам насилля. Лінія абсолютно безкоштовна та працює цілодобово')
        await ctx.reply('📞 0 800 500 335 або 116 123 (з мобільного) Національна гаряча лінія з попередження домашнього насильства, торгівлі людьми та ґендерної дискримінації. Консультанти надають психологічну підтримку та план дій, як припинити насильство. Якщо ви не можете розмовляти, то допомогу можна отримати в текстовому форматі:')
        await ctx.reply('Skype: lastrada-ukraine')
        await ctx.replyWithHTML('Facebook: <a href="https://www.facebook.com/lastradaukraine">https://www.facebook.com/lastradaukraine</a>')
        await ctx.replyWithHTML('Email: hotline@la-strada.gov.ua')
        await ctx.replyWithHTML('Психологічні консультації для підлітків Teenergizer <a href="https://teenergizer.org/consultations/">https://teenergizer.org/consultations</a>')
        await ctx.reply('Можна отримати консультації про ознаки та причини психологічного насилля. Окрім того,  психологи надають підтримку підліткам у кризових ситуаціях. Це анонімно та безкоштовно.')
        await ctx.reply('Telegram чат-бот проєкту UNFPA Україна «Не дрібниці у стосунках» @no_trivia_bot – безоплатні психологічні консультації для підлітків.')
    } catch (e) {
        console.log(e)
    }
})
bot.hears('😯Я став(-ла) свідком домашнього насильства', async (ctx) => {
    try {
        await ctx.reply('Ознаки того, що особа може зазнавати насильства:')
        await ctx.reply('🔸боїться свого(-єї) партнера(-ки);')
        await ctx.reply('🔸прагне догодити своєму(-їй) партнерові(-ці);')
        await ctx.reply('🔸має фізичні травми або носить незвичний одяг (наприклад, протисонцеві окуляри в приміщенні або довгі рукави влітку);')
        await ctx.reply('🔸обмежена у спілкуванні з рідними та друзями;')
        await ctx.reply('🔸обмежена у доступі до грошей чи іншого майна;')
        await ctx.reply('🔸переживає депресію, тривогу або говорить про самогубство;')
        await ctx.reply('🔸закінчує розмову, коли партнер(-ка) поряд;')
        await ctx.reply('🔸збирається покинути роботу або вже покинула через бажання партнера(-ки).')
        await ctx.reply('Якщо ви помітили ці ознаки, намагайтеся знайти приватний момент, коли ви можете висловити занепокоєння і дати зрозуміти близькій людині, що ви її підтримуєте.')
        await ctx.reply('☝️Поради для такої розмови:')
        await ctx.reply('🔺Висловіть занепокоєння')
        await ctx.reply('Скажіть особі, що ви турбуєтеся про неї та хвилюєтеся. Це незасуджуючий підхід, який може спонукати заговорити про проблему. Якщо людина не хоче відкриватися, не тисніть, просто повідомте, що ви будете поруч, якщо вона захоче поговорити.')
        await ctx.reply('🔺Запевніть постраждалу особу, що насильство не є її виною.')
        await ctx.reply('Їй/йому може бути соромно за те, що відбувається і вона/він  може звинувачувати себе у всьому. Кривдники найчастіше кажуть постраждалим, що вони самі провокують насильство в їх сторону. Проте важливо пам’ятати, що відповідальність за домашнє насильство завжди лежить на кривдникові. Підтримайте постраждалу/-ого словами: “Ніхто не заслуговує на таке поводження”, “Ти не винна/винний”, “Те, що відбувається, не твоя вина”.')
        await ctx.reply('🔺Підтримуйте, але не давайте непрошених порад. Це може бути дуже складно зробити, особливо якщо страждає хтось із ваших близьких. Але пам’ятайте, що ви не можете змусити когось покинути стосунки, якщо вони не готові до цього. Також майте на увазі, що вихід із таких стосунків – найнебезпечніший час для постраждалої. Людина має самостійно оцінити рівень небезпеки для себе. Дайте їй варіанти та запропонуйте допомогу, підтримайте її. Тиск на постраждалу особу покинути стосунки, які вона не готова розірвати, може лише ще більше ізолювати її, змусивши її відчути, що вона не може вам довіритися.')
        await ctx.reply('📞102 – Національна поліція України;')
        await ctx.reply('📞1547 – Урядова гаряча лінія з питань запобігання та протидії домашньому насильству;')
        await ctx.reply('📞116 123 – Національна гаряча лінія протидії домашньому насильству.')
        await ctx.reply('🔺Зберігайте розмову в таємниці.')
        await ctx.reply('Запевніть, що все сказане залишиться між вами. Порушення довіри постраждалої особи після того, як вона відкрилася вам, може лише ізолювати її й навіть поставити під загрозу.')
        await ctx.reply('🔺Зберігайте розмову в таємниці.')
        await ctx.reply('Запевніть, що все сказане залишиться між вами. Порушення довіри постраждалої особи після того, як вона відкрилася вам, може лише ізолювати її й навіть поставити під загрозу.')

    } catch (e) {
        console.log(e)
    }
})

bot.hears('🙅‍♀️Сексуальне насильство', async (ctx) => {
    try {
        await ctx.reply('Сексуальне насильство – форма домашнього насильства, що включає будь-які діяння сексуального характеру, вчинені стосовно повнолітньої особи без її згоди або стосовно дитини незалежно від її згоди, або в присутності дитини, примушування до акту сексуального характеру з третьою особою, а також інші правопорушення проти статевої свободи чи статевої недоторканості особи, у тому числі вчинені стосовно дитини або в її присутності.')
        await ctx.reply('❗Сексуальним насильством вважають багато інших дій, коли не обов’язково використовується груба сила, як от:')
        await ctx.reply('🔸образливі сексуальні коментарі, а також натяки, погляди і телефонні дзвінки такого ж типу;')
        await ctx.reply('🔸демонстрація статевих органів (ексгібіціонізм);')
        await ctx.reply('🔸небажані дотики до різних частин тіла;')
        await ctx.reply('🔸обман, шантаж, залякування, що мають на меті примусити до сексуальної близькості або оголення;')
        await ctx.reply('🔸примус до сексу з іншими людьми;')
        await ctx.reply('🔸примус до збочених форм сексуальних відносин примус займатися до порно-індустрією чи секс-бізнесом;')
        await ctx.reply('🔸примус до вагітності або аборту;')
        await ctx.reply('🔸примус до спостереження за статевим контактом кривдника.')
    } catch (e) {
        console.log(e)
    }
})
bot.hears('😓Психологічне насильство', async (ctx) => {
    try {
        await ctx.reply('Не існує ідеальних стосунків. Завжди є суперечки, конфлікт інтересів та сварки. Проте, коли людина усвідомлено принижує та знецінює іншу — це ознака психологічного насильства. Сьогодні ми розберемось із видами психологічного насилля та розповімо, куди звертатись по допомогу.', await angry())
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🤔Як розпізнати психологічне насилля?', async (ctx) => {
    try {
        await ctx.reply('Психологічне насилля — це маніпуляції, словесні образи, приниження та шантаж. Кривдник(-ця) чинить насилля зумисне, аби викликати в людини емоційну реакцію та завдати шкоди.')
        await ctx.replyWithHTML('<b>📝Ознаки психологічного насилля:</b>')
        await ctx.replyWithHTML(`<b>🔺Контроль.</b>`)
        await ctx.reply('Кривдник(-ця) прагне керувати життям іншої людини. Хоче впливати на вибір роботи, друзів чи навіть одягу.')
        await ctx.replyWithHTML('<b>🔺Знецінення.</b>')
        await ctx.replyWithHTML(`Це приниження, нецензурна лайка та словесні образи.  Таким чином кривдник(-ця) прагне завдати емоційного болю іншій людині.`)
        await ctx.replyWithHTML('<b>🔺Ігнорування.</b>')
        await ctx.replyWithHTML(`Кривдник(-ця) ігнорує потреби людини та вдає, що її не існує. Це один із методів покарання`)
        await ctx.replyWithHTML('<b>🔺Ізоляція.</b>')
        await ctx.replyWithHTML(`Кривдник(-ця) забороняє спілкуватись з іншими людьми, ходити на роботу або навчання.`)
        await ctx.replyWithHTML('<b>🔺Переслідування.</b>')
        await ctx.replyWithHTML(`Кривдник(-ця) стежить за постраждалою(-им) в реальному житті та соцмережах. Погрожує та шантажує, аби отримати бажане. В психологічному насиллі кривдник(-ця) намагається встановити контроль над життям іншої людини та самоствердитись завдяки цьому. Особливо поширене психологічне насилля – в сім’ї. Донедавна фрази на кшталт «я знаю, як тобі краще!» та «ти мені винна/винен, бо ми тебе виховали» сприймались як частина виховання. Проте ці словесні маніпуляції належать до психологічного насилля.`)

    } catch (e) {
        console.log(e)
    }
})
bot.hears('😬Якщо я аб’юзер(-ка)?', async (ctx) => {
    try {
        await ctx.reply('Перевірте чи не є ви аб’юзером(-кою) у вашій парі:', await angry())
        await ctx.reply('1.Чи намагаєтеся ви постійно контролювати де і з ким ваша кохана людина? (0.5 балів):')
        await ctx.reply('2.Ви часто ревнуєте її/його до друзів та інших людей? (0.5 балів)')
        await ctx.reply('3.Ви часто критикуєте та ображаєте свою(-го) партнерку(-а)? (0.5 балів)')
        await ctx.reply('4.Ви хочете, щоб ваша кохана людина не навчалася та/або не працювала? (3 бали)')
        await ctx.reply('5.Чи бувають у вас “погані дні”, коли ви відчуваєте спалах гніву і зриваєтеся на свою(-го) партнерку(-а)? (3 бали)')
        await ctx.reply('6.Чи штовхали, кидали предмети або іншим способом завдали фізичного болю партнерці(-у)? (6 бали)')
        await ctx.reply('7. Чи вважаєте, що у цьому винні алкоголь/наркотики або поведінка партнерки(-а)? (6 бали)')
        await ctx.reply('8.Чи залякували ви або шантажували свою(-го) партнерку(-а)? (6 бали)')
        await ctx.reply('9.Чи змушували ви свою(-го) партнерку(-а) до сексу? (6 бали)')
        await ctx.reply('0.5 - 3 бали – ваша поведінка може бути кваліфікована як психологічне насильство, рекомендуємо відкрито поговорити з партнеркою(-ом) та звернутися за допомогою.')
        await ctx.reply('3 – 9 балів – ймовірно ви є кривдником у стосунках. Варто звернутися за психологічною підтримкою.')
        await ctx.reply('10 – 15 балів – ваші дії стосовно партнерки(-а) є протиправними. Обов’язково зверніться до спеціалістів для корекції вашої поведінки.')
        await ctx.reply('📝 Поставте чек там, де вважаєте, що це про вас:')
        await ctx.reply('🔺Ви вважає те, що завжди праві, а навколо всі помиляються (всі дурні)')
        await ctx.reply('🔺Ви не розрізняєте емоції і дії')
        await ctx.reply('🔺Ваші конфлікти в більшості випадків закінчуються сваркою')
        await ctx.reply('🔺Вам необхідно контролювати свого(-ю) партнера(-ку)')
        await ctx.reply('🔺Ви маніпулюєте діями свого(-єї) партнера(-ки)')
        await ctx.reply('🔺Ваша поведінка змінилася/погіршилася на відміну від початку стосунків, по відношенню до партнер(-/ки)')
        await ctx.reply('🔺Ваш(-а) партнер(-ка) часто каже, що у вас поганий настрій, ви його/її не чуєте, робите все, як вважаєте за потрібне.')
        await ctx.reply(`Якщо ви виявили у себе ці ознаки аб'юзивної поведінки, рекомендуємо все ж звернутися разом з партнером(-кою) за психологічною допомогою до фахівця.`)
        await ctx.reply('Для  початку якісних змін у ваших стосунках можете почати з таких кроків ⤵️')
        await ctx.reply('❤️ Зрозумійте, що партнер(-ка) не ваша  власність.️')
        await ctx.reply(`Саме тому вам не варто вимагати від нього/неї припинити спілкування з близькими та друзями. А також неправильно, якщо ви нав'язуєте йому/їй свої цінності, пріоритети та захоплення. Загалом він/вона вільний(-на) і здатний(-на) сам(-а) вирішувати, як йому/їй жити. Вчіться приймати його/її автономність.`)
        await ctx.reply('❤️Шануйте особисті межі людини.')
        await ctx.reply('Особисте місце, особисті речі – з цього моменту вам табу. Кожна людина має право навіть на свої секрети. Ваше ж бажання повністю поринути і розчинитися в житті іншого/іншої, чекати повного звіту про все, що він/вона думає, відчуває, порушує його/її права.')
        await ctx.reply('❤️Контролюйте свої емоції.')
        await ctx.reply('Варто освоїти ази самовладання. У цьому вам допоможуть медитації, спорт, йога. Вчіться керувати собою. Неправильно, коли вас будь-яка дрібниця вибиває з колії. Здатність затриматися у стані спокою, свідомість залишає ясним, не виникають різкі, необдумані вчинки агресивного характеру.')
        await ctx.reply('❤️Спробуйте поставити себе на місце іншої людини.')
        await ctx.reply('Найдієвіша вправа – це відчути те, через що проходить партнер(-ка), перебуваючи з вами у стосунках. Для цього вам варто поставити себе на місце обранця(-ниці). Усвідомте, що він/вона відчуває, коли ви його/її підозрюєте, вимагаєте звіту, намагаєтеся викрити у всіх гріхах. Як йому/їй неприємно, коли ви влаштовуєте скандал у відповідь на будь-яку дрібницю. Ви зрозумієте, що йому/їй непросто, а він/вона живе в цьому, можливо, роками.')
        await ctx.reply('❤️Займіться своїми справами.')
        await ctx.reply('Замість контролювати партнера, займіться своїм життям. Приділяйте більше часу власному саморозвитку, знайдіть додаткові захоплення. Тоді часу на пошук недоліків у обранця(-ниці) залишатиметься набагато менше.')
        await ctx.reply('Вам однозначно варто змінювати стосунки, адже насправді ви робите нещасним і себе, і партнера(-ку).')
        await ctx.reply('☝️Можливе усвідомлення своїх негативних рис – перший крок на шляху до здорових та щасливих стосунків.')
    } catch (e) {
        console.log(e)
    }
})
bot.hears('🆘Допомога', async (ctx) => {
    try {
        await ctx.replyWithHTML('<b>❓Куди звернутись по допомогу?</b>')
        await ctx.replyWithHTML('Про психологічне насилля не можна мовчати. Міністерство охорони здоров’я України зазначає, що тривале психологічне насилля приводить до психологічних розладів, безсоння та панічних атак.  Перш за все, звертатись потрібно до поліції за номером 102. Правоохоронці приїжджають на місце виклику, зупиняють насилля та допомагають написати заяву на кривдника(-цю).')
        await ctx.replyWithHTML(`Консультації, підтримку чи допомогу можна отримати також на лініях:`)
        await ctx.replyWithHTML(`<b>✅15-47</b>`)
        await ctx.replyWithHTML(`Гаряча лінія для постраждалих від домашнього насильства. Одна з її функцій — це психологічна допомога жертвам насилля. Лінія абсолютно безкоштовна та працює цілодобово.`)
        await ctx.replyWithHTML(`✅ 0 800 500 335 або 116 123`)
        await ctx.replyWithHTML(`(з мобільного) Національна гаряча лінія з попередження домашнього насильства, торгівлі людьми та ґендерної дискримінації. Консультанти надають психологічну підтримку та план дій, як припинити насильство.'`)
    } catch (e) {
        console.log(e)
    }
})








// bot.hears('Про чат-бота 🤖', async (ctx) => {
//     try {
//         ctx.reply('Ви повернулись до головного меню', await aboutChatBot())
//     } catch (e) {
//         console.log(e)
//     }
// })


// bot.hears('Відео 📹', async (ctx) => {
//     try {
//         console.log(ctx.message.id)
//
//         // send local documents
//
//         ctx.telegram.sendDocument(ctx.from.id, {
//             source: './data/pdf/dopomogaTest.doc',
//             filename: 'dopomogaTest'
//         })
//
//         // Send video
//
//         // ctx.replyWithMediaGroup([
//         //     {
//         //         type: 'video',
//         //         media: {
//         //             source: './data/video/protect.mp4',
//         //             filename: 'BigBuckBunny'
//         //         }
//         //     }
//         // ])
//
//     } catch (e) {
//         console.log(e)
//     }
// })

// Стикер пример
//    await ctx.sendSticker(ctx.chat.id ,{sticker:'CAACAgEAAxkBAAIzAWO15MremdoT61rrLx6S9JBPPB2yAAIZAwACWv8ZROBIaOlTU1-BLQQ'})

// bot.on('sticker',async (ctx) => {
// await ctx.sendSticker({stiker:"CAACAgEAAxkBAAIzAWO15MremdoT61rrLx6S9JBPPB2yAAIZAwACWv8ZROBIaOlTU1-BLQQ"})
// console.log(await ctx.message);
// })

bot.launch();
// Enable graceful stop
process.once('SIGINT', () => bot.stop('SIGINT'));